app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
---
	def index
		@contact = Contact.all

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ?  ORDER BY "contacts"."id" ASC LIMIT 1  [["id", 6]]
---
	def show
		@contact = Contact.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
	def new
		o = [('a'..'z'), ('A'..'Z')].map { |i| i.to_a }.flatten
		@string = (0...8).map { o[rand(o.length)] }.join
		@user = User.find(params[:id])