app/controllers/users_controller.rb

	def show
		url = url_for( :controller => 'contacts/registrations', :action => 'new' )
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]